<script setup lang="ts">

import AppFooter from '@/components/footer/appFooter.vue'
import AppHeader from '@/components/header/appHeader.vue'
</script>
<template>
  <AppHeader />
  <div class="delivery-payment">
    <h2>Оплата:</h2>
    <p>Оплата принимается наличные и кредитные карты</p>
    <div class="payment-methods">
      <img src="/src/assets/img/Visa.png" alt="" />
      <img src="/src/assets/img/Mastercard.png" alt="" />
    </div>
    <p>Для покупок совершённых в интернет магазине предоплата на выбор удобные способы оплаты:</p>
    <ul>
      <li>Наличными при доставке курьером</li>
      <li>Банковским переводом на наш расчётный счёт</li>
      <li>Банковским переводом с карты на карту</li>
    </ul>
    <p>
      Информация по каждому способу оплаты предоставлена в форме при оформлении заказа, выбираете
      удобный вам способ, ставите галочку, появляются необходимые реквизиты.
    </p>

    <h2>Доставка:</h2>
    <p>
      Мы доставляем заказы по всей России строго в сроки, согласованные с клиентом. Сроки доставки
      зависят от выбранного способа доставки и загруженности курьеров. Мы обеспечиваем быструю и
      качественную доставку, гарантируем сохранность товара и контролируем процесс от начала до
      конца.
    </p>
    <h3>Как происходит доставка:</h3>
    <ul>
      <li>После оформления заказа вы подтверждаете оптимальный способ отправки.</li>
      <li>Организуем передачу груза в транспортную компанию.</li>
      <li>Предоставляем трек-номер для отслеживания доставки.</li>
      <li>
        Вы получаете заказ удобным для вас способом: курьерская доставка или самовывоз из пункта
        выдачи.
      </li>
    </ul>
    <h3>Преимущества нашей доставки:</h3>
    <ul>
      <li>Широкая география: любой город России и СНГ.</li>
      <li>Выбор удобной транспортной компании.</li>
      <li>Возможность ускоренной доставки.</li>
      <li>Отслеживание отправления в реальном времени.</li>
      <li>Полное сопровождение всех этапов доставки.</li>
      <li>Гибкие условия: возможность изменения условий доставки в процессе.</li>
    </ul>
    <p>Доставка — это процесс, когда с вами работают профессионалы!</p>
  </div>
  <AppFooter />
</template>

<style scoped>
.delivery-payment {
  max-width: 1200px;
  margin: 20px auto;
}

.delivery-payment h2 {
  font-size: 2em;
  margin-bottom: 10px;
  text-align: center;
}

.delivery-payment p,
.delivery-payment ul {
  font-size: 1.2em;
  color: #666;

  margin-bottom: 20px;
}

.payment-methods {
  display: flex;

  gap: 20px;
  margin-bottom: 20px;
}

.payment-methods img {
  width: 100px;
  height: auto;
}
</style>
